#include "app_config.h"
#include "gSensor_manage.h"
#include "hrSensor_manage.h"

//==========================================================//
//                 		VAD库使能开关                       //
//==========================================================//
const int LIB_CONFIG_VAD_ENABLE = CONFIG_VAD_ENABLE;

//==========================================================//
//                 		LPCTMU库使能开关                    //
//==========================================================//
const int LIB_CONFIG_LPCTMU_ENABLE = CONFIG_LPCTMU_ENABLE;

//==========================================================//
//                 		异常函复位开关                      //
//==========================================================//
const int LIB_CONFIG_EXCEPTION_RESET_ENABLE = !CONFIG_UART_DEBUG_ENABLE;

//==========================================================//
//              DVAD第三方算法使能开关                      //
//==========================================================//
const int CONFIG_DVAD_DEVELOP_ENABLE = 0;
